class Clock {
	hour;
	minute;

	constructor(h, m) {
		this.hour = h;
		this.minute = m;
	}

	get_hour() { return this.hour; }
	get_min() { return this.minute; }
};

class Lesson {
	start_at;
	finish_at;
	less_name;
	lessons_number;
	teacher;
	less_char;

	constructor(start_h, start_m, finish_h, finish_m, less_name, lesson_number, teacher, less_char) {
		this.start_at = new Clock(start_h, start_m);
		this.finish_at = new Clock(finish_h, finish_m);
		this.less_name =	less_name;
		this.lessons_number =	lesson_number;
		this.teacher = teacher;
		this.less_char = less_char;
	}

	get_start() {
		return this.start_at;
	}
	get_finish() {
		return this.finish_at;
	}
};

const lessons = [
	[
		new Lesson(13, 10, 13, 55, 'Գնագոյացումը շինարարության ոլորտում', 7113, 'Գալոյան Գ', 'Գ'),
		new Lesson(13, 10, 13, 55, 'Գնագոյացումը շինարարության ոլորտում', 7113, 'Գալոյան Գ', 'Գ'),
		new Lesson(14, 0, 14, 45, 'Գնագոյացումը շինարարության ոլորտում', 7113, 'Գալոյան Գ', 'Գ'),
		new Lesson(14, 55, 14, 45, 'Գնագոյացումը շինարարության ոլորտում', 7113, 'Գալոյան Գ', 'Գ'),
		new Lesson(14, 45, 16, 30, 'Կառավարչական հաշվառում', 2431, 'Բարիկյան', 'Դ'),
		new Lesson(16, 30, 17, 25, 'Կառավարչական հաշվառում', 2431, 'Բարիկյան', 'Դ/Գ'), 
		new Lesson(17, 30, 18, 15, 'Կառավարչական հաշվառում', 2431, 'Բարիկյան', 'Գ'),
	],

	[
		new Lesson(9, 30, 10, 15, 'Հարկեր, վճարներ, տուրքեր ', 2030, 'Աղաջանյան Հ.', 'Դ'),
		new Lesson(10, 20, 11, 5, 'Հարկեր, վճարներ, տուրքեր ', 2030, 'Աղաջանյան Հ.', 'Դ'),
		new Lesson(11, 15,  12, 0, 'Հարկեր, վճարներ, տուրքեր ',  3102, 'Աղաջանյան Հ.',  'Դ/Գ' ),
		new Lesson(12, 5, 12, 50, 'Հարկեր, վճարներ, տուրքեր ', 3102, 'Աղաջանյան Հ.', 'Դ/Գ' ),
		new Lesson( 13, 10, 13, 55, 'Հարկեր, վճարներ, տուրքեր ',  3102,  'Աղաջանյան Հ.', 'Գ'),
		new Lesson( 14, 0, 14, 45, 'Հարկեր, վճարներ, տուրքեր ',  3102,  'Աղաջանյան Հ.', 'Գ'),
		new Lesson( 14, 55, 15, 40, 'Մարքեթինգ',  2429,  'Բեգլարյան Ա.', 'Դ'),
		new Lesson( 15, 45, 16, 30, 'Մարքեթինգ',  2429,  'Բեգլարյան Ա.', 'Դ'),
		new Lesson( 16, 40, 17, 25, 'Մարքեթինգ',  2429,  'Բեգլարյան Ա.', 'Դ'),
	],

	[
		new Lesson( 13, 10, 13, 55, 'Շինարարական արտադրության տեխնոլոգիա և կազմակերպում', 2116, 'Ղուլյան', 'Դ'),
		new Lesson( 14, 0, 14, 45, 'Շինարարական արտադրության տեխնոլոգիա և կազմակերպում', 2116, 'Ղուլյան', 'Դ'),
		new Lesson( 14, 55, 15, 40, 'Շինարարական արտադրության տեխնոլոգիա և կազմակերպում', 2116, 'Ղուլյան', 'Գ'),
		new Lesson( 15, 45, 16, 30, 'Շինարարական արտադրության տեխնոլոգիա և կազմակերպում', 2116, 'Ղուլյան', 'Գ'),
		new Lesson( 16, 40, 17, 25, 'Գնագոյացումը շինարարության ոլորտում', 2418, 'Գալոյան Գ.', 'Գ'),
		new Lesson( 17, 30, 18, 15, 'Գնագոյացումը շինարարության ոլորտում', 2418, 'Գալոյան Գ.', 'Գ'),
		new Lesson( 18, 25, 19, 10, 'Գնագոյացումը շինարարության ոլորտում', 2418, 'Գալոյան Գ.', 'Գ'),
	],

	[
		new Lesson(12, 5, 12, 50, 'Վիճակագրության տեսության հիմունքները', 17302, 'Եդոյան', 'Դ'),
		new Lesson(13, 10, 13, 55, 'Վիճակագրության տեսության հիմունքները', 17302, 'Եդոյան', 'Դ'),
		new Lesson(14, 0, 14, 45, 'Վիճակագրության տեսության հիմունքները', 17302, 'Եդոյան', 'Դ'),
		new Lesson(14, 55, 15, 40, 'Մարքեթինգ',  2429, 'Բեգլարյան Ա.',  'Գ'),
		new Lesson(15, 45, 16, 30, 'Մարքեթինգ',  2429, 'Բեգլարյան Ա.',  'Գ'),
		new Lesson(16, 40, 17, 25, 'Մարքեթինգ',  2429, 'Բեգլարյան Ա.',  'Գ'),
	],

	[
		new Lesson( 11, 15, 12, 0, 'Վիճակագրության տեսության հիմունքները', 2241,  'Եդոյան Տ.', 'Գ'),
		new Lesson( 12, 5, 12, 50, 'Վիճակագրության տեսության հիմունքները', 2241,  'Եդոյան Տ.', 'Գ'),
		new Lesson(13, 10, 13, 55, 'Լոգիստիկա', 2107, 'Աղաջանյան Հ.', 'Դ'),
		new Lesson(14, 0, 14, 45, 'Լոգիստիկա', 2107, 'Աղաջանյան Հ.', 'Դ'),
		new Lesson(14, 55, 15, 40, 'Լոգիստիկա', 2107, 'Աղաջանյան Հ.', 'Դ'),
		new Lesson(15, 45, 16, 30, 'Լոգիստիկա', 2107, 'Աղաջանյան Հ.', 'Գ'),
		new Lesson(16, 40, 17, 25, 'Լոգիստիկա', 2107, 'Աղաջանյան Հ.', 'Գ'),
	],
];